Revit 2027 API
ElementNode Class
 A render node that represents an element, including the host document containing the element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ElementNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementNode : RenderNode
Public Class ElementNode
	Inherits RenderNode
public ref class ElementNode : public RenderNode
type ElementNode =
    class
        inherit RenderNode
    end
The ElementNode type exposes the following members.
Properties
Name | Description
Document |  Gets the document associated with the element.
ElementId |  The Id of the element.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
LinkInstanceId |  The Id of the link instance for the element.
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 See also: OnElementBegin2D(ElementNode). See also: OnElementEnd2D(ElementNode).
See Also
Reference
Autodesk.Revit.DB Namespace